; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world: modified for Slaney's BWSTATES generator
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain blocksworld)
  (:requirements :strips :typing)
  (:types block)
  (:predicates (on ?x - block ?y - block)
	       (on-table ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (on-table ?x) (handempty))
	     :effect
	     (and (not (on-table ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (on-table ?x)))
  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x - block ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem BW-6-4532-5)
    (:domain blocksworld)
    (:objects b1 b2 b3 b4 b5 b6 - block)
    (:init
        (handempty)
        (on-table b1)
        (on b2 b5)
        (on-table b3)
        (on-table b4)
        (on b5 b1)
        (on-table b6)
        (clear b2)
        (clear b3)
        (clear b4)
        (clear b6)
    )
    (:goal
        (and
            (on b1 b4)
            (on b2 b3)
            (on-table b3)
            (on b4 b5)
            (on-table b5)
            (on-table b6)
        )
    )
)

; plan
1. (unstack b2 b5)
   deleted: (clear b2) (handempty) (on b2 b5)
   added: (holding b2) (clear b5)
   goals met: 2 of 6
2. (stack b2 b3)
   deleted: (holding b2) (clear b3)
   added: (clear b2) (handempty) (on b2 b3)
   goals met: 3 of 6
3. (unstack b5 b1)
   deleted: (clear b5) (handempty) (on b5 b1)
   added: (holding b5) (clear b1)
   goals met: 3 of 6
4. (put-down b5)
   deleted: (holding b5)
   added: (clear b5) (handempty) (on-table b5)
   goals met: 4 of 6
5. (pick-up b4)
   deleted: (on-table b4) (clear b4) (handempty)
   added: (holding b4)
   goals met: 4 of 6
6. (stack b4 b5)
   deleted: (holding b4) (clear b5)
   added: (clear b4) (handempty) (on b4 b5)
   goals met: 5 of 6
7. (pick-up b1)
   deleted: (on-table b1) (clear b1) (handempty)
   added: (holding b1)
   goals met: 5 of 6
8. (stack b1 b4)
   deleted: (holding b1) (clear b4)
   added: (clear b1) (handempty) (on b1 b4)
   goals met: 6 of 6
